
const TRIGGER_EVENTS = [
    '高级魔兽要诀',
    '高级召唤兽内丹',
    '花豆',
    '幼儿园',
    '妖王',
    '环装'
];

const MAPS = [
    '傲来国', '五庄观', '建邺城', '朱紫国', '狮驼岭', '普陀山', '东海湾', 
    '花果山', '女儿村', '麒麟山', '墨家村', '大唐境外', '江南野外', 
    '北俱芦洲', '长寿郊外'
];

const MAP_SCROLL_MAPPING = {
    '傲来国': ['高级连击', '高级吸血', '高级飞行'],
    '五庄观': ['高级必杀', '高级精神集中', '高级幸运'],
    '建邺城': ['高级偷袭', '奔雷咒', '泰山压顶'],
    '朱紫国': ['高级法术暴击', '高级魔之心', '高级雷属性吸收'],
    '狮驼岭': ['高级防御', '高级火属性吸收', '高级法术暴击', '高级水属性吸收'],
    '普陀山': ['高级驱鬼', '高级慧根', '高级毒', '高级盾气'],
    '东海湾': ['高级法术连击', '高级强力', '高级水属性吸收'],
    '花果山': ['嗜血追击', '高级反击', '高级慧根', '高级强力'],
    '女儿村': ['高级法术波动', '高级招架', '高级神迹', '高级合纵'],
    '麒麟山': ['高级神佑复生', '高级水属性吸收', '高级土属性吸收', '惊心一剑'],
    '墨家村': ['壁垒击破', '高级隐身', '高级再生', '高级土属性吸收'],
    '大唐境外': ['高级神佑复生', '高级鬼魂术', '高级冥思', '高级合纵'],
    '江南野外': ['高级隐身', '高级感知', '高级再生'],
    '北俱芦洲': ['高级敏捷', '高级魔之心', '高级否定信仰', '高级强力'],
    '长寿郊外': ['高级夜战', '高级反击', '高级反震', '高级土属性吸收']
};

const ADVANCED_INNER_CORES = [
    '生死决', '舍身击', '碎甲刃', '腾挪劲', '催心浪', '双星爆', 
    '电魂闪', '玄武躯', '阴阳护', '凛冽气', '玉砥柱', '神机步', '龙胄铠'
];

module.exports = {
    TRIGGER_EVENTS,
    MAPS,
    MAP_SCROLL_MAPPING,
    ADVANCED_INNER_CORES
};
